
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12872124426)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_iam_policy_attachment.ecs_codedeploy
* Replace
  * aws_iam_role.ecs_codedeploy


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy_attachment.ecs_codedeploy will be created
  + resource "aws_iam_policy_attachment" "ecs_codedeploy" {
      + id         = (known after apply)
      + name       = "ECSCodeDeploy"
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + roles      = [
          + "ECSCodeDeploy",
        ]
    }

  # aws_iam_role.ecs_codedeploy must be replaced
-/+ resource "aws_iam_role" "ecs_codedeploy" {
      ~ arn                   = "arn:aws:iam::992382441056:role/ECSCodeDeployV3" -> (known after apply)
      ~ create_date           = "2025-01-20T16:06:39Z" -> (known after apply)
      ~ id                    = "ECSCodeDeployV3" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "ECSCodeDeployV3" -> "ECSCodeDeploy" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA6ODU2KZQO2UBWIO3L" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"88c05af538cfbb1f581ffe0088114df2cf7a4200","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->